performance/borat/passenger.txt
      done.

Transactions:		          50 hits
Availability:		      100.00 %
Elapsed time:		        2.58 secs
Data transferred:	        0.05 MB
Response time:		        1.42 secs
Transaction rate:	       19.38 trans/sec
Throughput:		        0.02 MB/sec
Concurrency:		       27.58
Successful transactions:          50
Failed transactions:	           0
Longest transaction:	        2.56
Shortest transaction:	        0.45
 
FILE: /usr/local/var/siege.log
You can disable this annoying message by editing
the .siegerc file in your home directory; change
the directive 'show-logfile' to false.