performance/borat/thin.txt
      done.

Transactions:		          50 hits
Availability:		      100.00 %
Elapsed time:		        2.64 secs
Data transferred:	        0.05 MB
Response time:		        1.43 secs
Transaction rate:	       18.94 trans/sec
Throughput:		        0.02 MB/sec
Concurrency:		       27.06
Successful transactions:          50
Failed transactions:	           0
Longest transaction:	        2.57
Shortest transaction:	        0.38
 
FILE: /usr/local/var/siege.log
You can disable this annoying message by editing
the .siegerc file in your home directory; change
the directive 'show-logfile' to false.