performance/borat/unicorn.txt
      done.

Transactions:		          50 hits
Availability:		      100.00 %
Elapsed time:		        2.11 secs
Data transferred:	        0.05 MB
Response time:		        0.57 secs
Transaction rate:	       23.70 trans/sec
Throughput:		        0.02 MB/sec
Concurrency:		       13.40
Successful transactions:          50
Failed transactions:	           0
Longest transaction:	        1.10
Shortest transaction:	        0.25
 
FILE: /usr/local/var/siege.log
You can disable this annoying message by editing
the .siegerc file in your home directory; change
the directive 'show-logfile' to false.